stresstest.yml
config:
  target: "http://localhost:3003/api"
  http:
    pool: 10
  phases:
    - duration: 30
      arrivalRate: 1
      name: 1 RPS
    - duration: 30
      arrivalRate: 10
      name: 10 RPS
    - duration: 60
      arrivalRate: 100
      name: 100 RPS
    - duration: 120
      arrivalRate: 1000
      name: 1000 rps
scenarios:
  - flow:
    - get:
        url: "/tips/{{ $randomNumber(9000000, 10000000) }}"
        capture:
          json: "$[0].id"
          as: "id"
    - get:
        url: "/articles/{{ id }}"
    - get:
        url: "/features/{{ id }}"