stresstest.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up
    - duration: 300
      arrivalRate: 50
      name: Sustained load
scenarios:
  - flow:
    - get:
        url: "/api/tips/{{ $randomNumber(9000000, 10000000) }}"
        capture:
          json: "$[0].id"
          as: "id"
    - get:
        url: "/api/articles/{{ id }}"
    - get:
        url: "/api/features/{{ id }}"